read_verilog -sv ../src_verilog_dfd/mor1k_16Soc_top.v 
read_verilog -sv ../src_verilog_dfd/mor1k_16Soc.v 
#read_verilog -sv ../src_verilog_dfd/testbench.v 
read_verilog -sv ../src_verilog_dfd/tiles/mor1k_tile.v 
read_verilog -sv ../src_verilog_dfd/lib/ni_master.v 
read_verilog -sv ../src_verilog_dfd/lib/clk_source.v 
read_verilog -sv ../src_verilog_dfd/lib/mesh_torus_routting.v 
read_verilog -sv ../src_verilog_dfd/lib/fattree.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_bus_if_avalon.v 
read_verilog -sv ../src_verilog_dfd/lib/inout_ports.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_cpu.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_cpu_cappuccino.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_branch_prediction.v 
read_verilog -sv ../src_verilog_dfd/lib/comb-spec1.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_pic.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_cfgrs.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_cpu_espresso.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_cache_lru.v 
read_verilog -sv ../src_verilog_dfd/lib/generic_ram.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_immu.v 
read_verilog -sv ../src_verilog_dfd/lib/traffic_gen.v 
read_verilog -sv ../src_verilog_dfd/lib/routing.v 
read_verilog -sv ../src_verilog_dfd/lib/main_comp.v 
read_verilog -sv ../src_verilog_dfd/lib/class_table.v 
read_verilog -sv ../src_verilog_dfd/lib/credit_count.v 
read_verilog -sv ../src_verilog_dfd/lib/congestion_analyzer.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_lsu_espresso.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_ctrl_espresso.v 
read_verilog -sv ../src_verilog_dfd/lib/altera_reset_synchronizer.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_lsu_cappuccino.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_execute_ctrl_cappuccino.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_execute_alu.v 
read_verilog -sv ../src_verilog_dfd/lib/baseline.v 
read_verilog -sv ../src_verilog_dfd/lib/noc.v 
read_verilog -sv ../src_verilog_dfd/lib/wrra.v 
read_verilog -sv ../src_verilog_dfd/lib/flit_buffer.v 
read_verilog -sv ../src_verilog_dfd/lib/tree.v 
read_verilog -sv ../src_verilog_dfd/lib/wb_single_port_ram.v 
read_verilog -sv ../src_verilog_dfd/lib/debug.v 
read_verilog -sv ../src_verilog_dfd/lib/altera_jtag_uart_wb.v 
read_verilog -sv ../src_verilog_dfd/lib/route_torus.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_store_buffer.v 
read_verilog -sv ../src_verilog_dfd/lib/timer.v 
read_verilog -sv ../src_verilog_dfd/lib/altera_simulator_UART.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_rf_cappuccino.v 
read_verilog -sv ../src_verilog_dfd/lib/mesh_torus_noc.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx.v 
read_verilog -sv ../src_verilog_dfd/lib/arbiter.v 
read_verilog -sv ../src_verilog_dfd/lib/mesh_torus.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_true_dpram_sclk.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_bus_if_wb32.v 
read_verilog -sv ../src_verilog_dfd/lib/comb_spec2.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_ctrl_prontoespresso.v 
read_verilog -sv ../src_verilog_dfd/lib/input_ports.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_dcache.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_decode.v 
read_verilog -sv ../src_verilog_dfd/lib/crossbar.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_cpu_prontoespresso.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_fetch_prontoespresso.v 
read_verilog -sv ../src_verilog_dfd/lib/ni_crc32.v 
read_verilog -sv ../src_verilog_dfd/lib/wishbone_bus.v 
read_verilog -sv ../src_verilog_dfd/lib/ss_allocator.v 
read_verilog -sv ../src_verilog_dfd/lib/route_mesh.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_wb_mux_espresso.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_icache.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_ticktimer.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_ctrl_cappuccino.v 
read_verilog -sv ../src_verilog_dfd/lib/byte_enabled_generic_ram.sv 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_rf_espresso.v 
read_verilog -sv ../src_verilog_dfd/lib/header_flit.v 
read_verilog -sv ../src_verilog_dfd/lib/comb_nonspec.v 
read_verilog -sv ../src_verilog_dfd/lib/combined_vc_sw_alloc.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_wb_mux_cappuccino.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_decode_execute_cappuccino.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_dmmu.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_fetch_tcm_prontoespresso.v 
read_verilog -sv ../src_verilog_dfd/lib/jtag_uart_wb.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_simple_dpram_sclk.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1k.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_fetch_espresso.v 
read_verilog -sv ../src_verilog_dfd/lib/wb_bram_ctrl.v 
read_verilog -sv ../src_verilog_dfd/lib/ni_vc_dma.v 
read_verilog -sv ../src_verilog_dfd/lib/router.v 
read_verilog -sv ../src_verilog_dfd/lib/mor1kx_fetch_cappuccino.v 
read_verilog -sv ../src_verilog_dfd/lib/ni_vc_wb_slave_regs.v 
read_verilog -sv ../src_verilog_dfd/lib/canonical_credit_count.v 
read_verilog -sv ../src_verilog_dfd/lib/jtag_wb/jtag_system_en.v 
read_verilog -sv ../src_verilog_dfd/lib/jtag_wb/jtag_source_probe.v 
read_verilog -sv ../src_verilog_dfd/lib/jtag_wb/vjtag.v 
read_verilog -sv ../src_verilog_dfd/lib/jtag_wb/vjtag_wb.v 
read_verilog -sv ../src_verilog_dfd/dfd/trace_buffer.sv 
#show

#hierarchy -top flit_buffer
#synth_xilinx -top fifo_ram
#synth -auto-top
synth
#show


# mapping to mycells.lib
#dfflibmap -liberty mycells.lib
#abc -liberty mycells.lib
#clean

proc; opt; techmap; opt
write_verilog synth.v

tee -o stat_dfd_4x4.txt stat

write_edif synth.edif